---
title: FabricationItemFile
classe: Autodesk.Revit.DB.FabricationItemFile
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# FabricationItemFile

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String Identifier { get; }` | `fabricationItemFile.Identifier` | String |
| `Boolean IsUsed { get; }` | `fabricationItemFile.IsUsed` | Boolean |
| `Boolean IsValidObject { get; }` | `fabricationItemFile.IsValidObject` | Boolean |
| `Void Dispose()` | `fabricationItemFile.Dispose()` | Void |
| `Boolean IsLoaded()` | `fabricationItemFile.IsLoaded()` | Boolean |
| `Boolean IsValid()` | `fabricationItemFile.IsValid()` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```